<script>
    const monetki=()=>{
        console.log('62 рубля:шанс выпадения рублевой монеты у кого-то: '+((20/62)+(20/62)))
        console.log('62 рубля:шанс выпадения двурублевой монеты у кого-то: '+((10/62)+(10/62)))
        console.log('62 рубля:шанс выпадения пятирублевой монеты у кого-то: '+((4/62)+(4/62)))
        console.log('62 рубля:шанс выпадения десятирублевой монеты у кого-то: '+((2/62)+(2/62)))
        console.log('22 рубля:шанс выпадения рублевой монеты у кого-то: '+((20/22)+(20/22)))
        console.log('22 рубля:шанс выпадения двурублевой монеты у кого-то: '+((10/22)+(10/22)))
        console.log('22 рубля:шанс выпадения пятирублевой монеты у кого-то: '+((4/22)+(4/22)))
        console.log('22 рубля:шанс выпадения десятирублевой монеты у кого-то: '+((2/22)+(2/22)))
        console.log('140 рублей:шанс выпадения двурублевой монеты у кого-то: '+((20/140)+(20/140)))
        console.log('140 рублей:шанс выпадения двурублевой монеты у кого-то: '+((10/140)+(10/140)))
        console.log('140 рублей:шанс выпадения пятирублевой монеты у кого-то: '+((4/140)+(4/140)))
        console.log('140 рублей:шанс выпадения десятирублевой монеты у кого-то: '+((2/140)+(2/140)))
    }
</script>

<button on:click={monetki}>Кинуть монетки</button>